<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
		<key>Copyright</key>
		<string>Copyright (c) Facebook, Inc. and its affiliates. All Rights Reserved</string>
        <key>Description</key>
        <string>Downloads the current release version of AdoptOpenJDK 11 and imports into Munki.</string>
        <key>Identifier</key>
        <string>com.github.facebook.munki.AdoptOpenJDK11</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>AdoptOpenJDK11</string>
            <key>MUNKI_REPO_SUBDIR</key>
            <string>apps/openjdk</string>
            <key>pkginfo</key>
            <dict>
                <key>catalogs</key>
                <array>
                    <string>testing</string>
                </array>
                <key>category</key>
                <string>Developer Tools</string>
                <key>description</key>
                <string>Adopt Open JDK 11</string>
                <key>developer</key>
                <string>AdoptOpenJDK</string>
                <key>display_name</key>
                <string>Adopt OpenJDK 11</string>
                <key>name</key>
                <string>%NAME%</string>
                <key>unattended_install</key>
                <true/>
            </dict>
        </dict>
        <key>MinimumVersion</key>
        <string>1.4.1</string>
        <key>ParentRecipe</key>
        <string>com.facebook.autopkg.download.AdoptOpenJDK11</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>pkg_path</key>
                    <string>%pathname%</string>
                    <key>repo_subdirectory</key>
                    <string>%MUNKI_REPO_SUBDIR%</string>
                </dict>
                <key>Processor</key>
                <string>MunkiImporter</string>
            </dict>
        </array>
    </dict>
</plist>
