<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
  <key>Description</key>
  <string>Creates a DMG for SQLDeveloper. You must provide your own .zip download using the -p argument.</string>
  <key>Identifier</key>
  <string>com.facebook.autopkg.dmg.sqldeveloper</string>
  <key>Input</key>
  <dict>
    <key>NAME</key>
    <string>SQLDeveloper</string>
  </dict>
  <key>MinimumVersion</key>
  <string>0.5.1</string>
  <key>Process</key>
  <array>
    <dict>
      <key>Processor</key>
      <string>PackageRequired</string>
      <key>Comment</key>
      <string>Requires manually providing SQLDeveloper .zip download.</string>
    </dict>
    <dict>
      <key>Processor</key>
      <string>PkgRootCreator</string>
      <key>Arguments</key>
      <dict>
        <key>pkgroot</key>
        <string>%RECIPE_CACHE_DIR%/%NAME%</string>
        <key>pkgdirs</key>
        <dict/>
      </dict>
    </dict>
    <dict>
      <key>Processor</key>
      <string>Unarchiver</string>
      <key>Arguments</key>
      <dict>
        <key>archive_path</key>
        <string>%PKG%</string>
        <key>destination_path</key>
        <string>%pkgroot%</string>
        <key>purge_destination</key>
        <true/>
      </dict>
    </dict>
    <dict>
      <key>Processor</key>
      <string>SQLDeveloperVersioner</string>
      <key>Arguments</key>
      <dict>
        <key>app_path</key>
        <string>%pkgroot%/SQLDeveloper.app</string>
      </dict>
    </dict>
    <dict>
      <key>Processor</key>
      <string>DmgCreator</string>
      <key>Arguments</key>
      <dict>
        <key>dmg_root</key>
        <string>%pkgroot%</string>
        <key>dmg_path</key>
        <string>%RECIPE_CACHE_DIR%/%NAME%-%version%.dmg</string>
      </dict>
    </dict>
  </array>
</dict>
</plist>