<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<!-- Copyright (c) Facebook, Inc. and its affiliates. All Rights Reserved -->
<dict>
    <key>Description</key>
    <string>Imports latest release of mosh from Github into Munki.</string>
    <key>Identifier</key>
    <string>com.facebook.autopkg.munki.github.mosh</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Mosh</string>
        <key>PRERELEASES</key>
        <string>True</string>
        <key>pkginfo</key>
        <dict>
                <key>unattended_install</key>
                <true/>
                <key>category</key>
                <string>Developer Tools</string>
                <key>developer</key>
                <string>MIT</string>
                <key>display_name</key>
                <string>Mosh</string>
                <key>catalogs</key>
                <array>
                    <string>testing</string>
                </array>
                <key>minimum_os_version</key>
                <string>10.6</string>
                <key>name</key>
                <string>%NAME%</string>
        </dict>
    </dict>
    <key>ParentRecipe</key>
    <string>com.facebook.autopkg.download.github.mosh</string>
    <key>MinimumVersion</key>
    <string>0.5.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>MoshVersioner</string>
            <key>Arguments</key>
            <dict/>
        </dict>
        <dict>
            <key>Processor</key>
            <string>MunkiPkginfoMerger</string>
            <key>Arguments</key>
            <dict>
                <key>additional_pkginfo</key>
                <dict>
                    <key>version</key>
                    <string>%version%</string>
                </dict>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>apps/mosh</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>