<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Copyright</key>
    <string>Copyright (c) Facebook, Inc. and its affiliates. All Rights Reserved</string>
    <key>Description</key>
    <string>Downloads latest release of mosh.</string>
    <key>Identifier</key>
    <string>com.facebook.autopkg.download.mosh</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Mosh</string>
        <key>PRERELEASES</key>
        <string>True</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.5.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://mosh.org/#getting</string>
                <key>re_pattern</key>
                <string>https://mosh.org/mosh-[0-9,.]\..\..\.pkg</string>
            </dict>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%match%</string>
            </dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
    </array>
</dict>
</plist>