<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Copyright</key>
		<string>Copyright (c) Facebook, Inc. and its affiliates. All Rights Reserved</string>
		<key>Description</key>
		<string>Downloads Intellij Disk Image and then moves it to Applications</string>
		<key>Identifier</key>
		<string>com.facebook.autopkg.install.intellij</string>
		<key>Input</key>
		<dict>
			<key>RELEASE</key>
			<string>latest</string>
		</dict>
		<key>MinimumVersion</key>
		<string>0.1.0</string>
		<key>ParentRecipe</key>
		<string>com.facebook.autopkg.download.intellij</string>
		<key>Process</key>
		<array>
			<dict>
				<key>Processor</key>
				<string>DeprecationWarning</string>
				<key>Arguments</key>
				<dict>
					<key>warning_message</key>
					<string>This recipe will soon be removed. Please remove it from your list of recipes.</string>
				</dict>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>dmg_path</key>
					<string>%pathname%</string>
					<key>items_to_copy</key>
					<array>
						<dict>
							<key>destination_path</key>
							<string>/Applications/</string>
							<key>source_item</key>
							<string>IntelliJ IDEA CE.app</string>
						</dict>
					</array>
				</dict>
				<key>Processor</key>
				<string>InstallFromDMG</string>
			</dict>
		</array>
	</dict>
</plist>
