<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Copyright</key>
        <string>Copyright (c) Facebook, Inc. and its affiliates. All Rights Reserved</string>
        <key>Description</key>
        <string>Downloads the latest version of Acrolinx and imports it into Munki.</string>
        <key>Identifier</key>
        <string>com.facebook.autopkg.munki.Acrolinx</string>
        <key>Input</key>
        <dict>
            <key>MUNKI_REPO_SUBDIR</key>
            <string>apps/acrolinx</string>
            <key>NAME</key>
            <string>Acrolinx</string>
            <key>pkginfo</key>
            <dict>
                <key>catalogs</key>
                <array>
                    <string>testing</string>
                </array>
                <key>category</key>
                <string>Productivity</string>
                <key>description</key>
                <string>Acrolinx helps you create more readable, findable, and engaging content.</string>
                <key>developer</key>
                <string>Acrolinx</string>
                <key>display_name</key>
                <string>Acrolinx</string>
                <key>name</key>
                <string>%NAME%</string>
                <key>unattended_install</key>
                <true/>
            </dict>
        </dict>
        <key>MinimumVersion</key>
        <string>2.0</string>
        <key>ParentRecipe</key>
        <string>com.facebook.autopkg.download.Acrolinx</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Processor</key>
                <string>DeprecationWarning</string>
                <key>Arguments</key>
                <dict>
                    <key>warning_message</key>
                    <string>These recipes have moved into nmcspadden-recipes, and the identifiers have changed. Please update your overrides!</string>
                </dict>
            </dict>
        </array>
    </dict>
</plist>
