<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Copyright</key>
		<string>Copyright (c) Facebook, Inc. and its affiliates. All Rights Reserved</string>
		<key>Description</key>
		<string>Extracts Duo.</string>
		<key>Identifier</key>
		<string>com.facebook.autopkg.extract.duo</string>
		<key>Input</key>
		<dict>
			<key>NAME</key>
			<string>Duo</string>
			<key>PREFIX_PATH</key>
			<string>opt/duo</string>
		</dict>
		<key>MinimumVersion</key>
		<string>0.2.0</string>
		<key>ParentRecipe</key>
		<string>com.facebook.autopkg.download.duo</string>
		<key>Process</key>
		<array>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>archive_path</key>
					<string>%pathname%</string>
					<key>destination_path</key>
					<string>%RECIPE_CACHE_DIR%/unpack</string>
				</dict>
				<key>Processor</key>
				<string>Unarchiver</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>pkgdirs</key>
					<dict/>
					<key>pkgroot</key>
					<string>%RECIPE_CACHE_DIR%/duo</string>
				</dict>
				<key>Processor</key>
				<string>PkgRootCreator</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>pattern</key>
					<string>%RECIPE_CACHE_DIR%/unpack/duo_unix-*/</string>
				</dict>
				<key>Processor</key>
				<string>FileFinder</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>installer_dir_path</key>
					<string>%found_filename%</string>
					<key>output_path</key>
					<string>%pkgroot%</string>
					<key>prefix_path</key>
					<string>/%PREFIX_PATH%</string>
				</dict>
				<key>Processor</key>
				<string>ConfigureMakeInstaller</string>
			</dict>
		</array>
	</dict>
</plist>
