<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Copyright</key>
		<string>Copyright (c) Facebook, Inc. and its affiliates. All Rights Reserved</string>
		<key>Description</key>
		<string>Packages Duo.</string>
		<key>Identifier</key>
		<string>com.facebook.autopkg.pkg.duo</string>
		<key>Input</key>
		<dict>
			<key>NAME</key>
			<string>Duo</string>
			<key>PREFIX_PATH</key>
			<string>opt/duo</string>
		</dict>
		<key>MinimumVersion</key>
		<string>0.2.0</string>
		<key>ParentRecipe</key>
		<string>com.facebook.autopkg.extract.duo</string>
		<key>Process</key>
		<array>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>header_file</key>
					<string>%found_filename%/config.h</string>
				</dict>
				<key>Processor</key>
				<string>ConfigHeaderVersioner</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>path_list</key>
					<array>
						<string>%pkgroot%/etc</string>
					</array>
				</dict>
				<key>Processor</key>
				<string>PathDeleter</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>pkg_request</key>
					<dict>
						<key>chown</key>
						<array>
							<dict>
								<key>group</key>
								<string>wheel</string>
								<key>mode</key>
								<string>4775</string>
								<key>path</key>
								<string>%PREFIX_PATH%/sbin/login_duo</string>
								<key>user</key>
								<string>root</string>
							</dict>
						</array>
						<key>id</key>
						<string>com.facebook.pkg.duo</string>
						<key>options</key>
						<string>purge_ds_store</string>
						<key>pkgdir</key>
						<string>%RECIPE_CACHE_DIR%</string>
					</dict>
					<key>pkgname</key>
					<string>%NAME%</string>
				</dict>
				<key>Processor</key>
				<string>PkgCreator</string>
			</dict>
		</array>
	</dict>
</plist>
