<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Copyright</key>
		<string>Copyright (c) Facebook, Inc. and its affiliates. All Rights Reserved</string>
		<key>Description</key>
		<string>Downloads latest release of Duo.</string>
		<key>Identifier</key>
		<string>com.facebook.autopkg.download.duo</string>
		<key>Input</key>
		<dict>
			<key>NAME</key>
			<string>Duo</string>
		</dict>
		<key>MinimumVersion</key>
		<string>0.2.0</string>
		<key>Process</key>
		<array>
			<dict>
				<key>Processor</key>
				<string>DeprecationWarning</string>
				<key>Arguments</key>
				<dict>
					<key>warning_message</key>
					<string>This recipe will soon be removed. Please remove it from your list of recipes.</string>
				</dict>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>url</key>
					<string>https://dl.duosecurity.com/duo_unix-latest.tar.gz</string>
				</dict>
				<key>Processor</key>
				<string>URLDownloader</string>
			</dict>
			<dict>
				<key>Processor</key>
				<string>EndOfCheckPhase</string>
			</dict>
		</array>
	</dict>
</plist>
