<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Copyright</key>
		<string>Copyright (c) Facebook, Inc. and its affiliates. All Rights Reserved</string>
		<key>Description</key>
		<string>Downloads latest Framer zip file.</string>
		<key>Identifier</key>
		<string>com.facebook.autopkg.download.framer</string>
		<key>Input</key>
		<dict>
			<key>DOWNLOAD_URL</key>
			<string>https://dl.devmate.com/com.motif.framer/FramerStudio.zip</string>
			<key>NAME</key>
			<string>Framer</string>
		</dict>
		<key>MinimumVersion</key>
		<string>0.2.0</string>
		<key>Process</key>
		<array>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>filename</key>
					<string>%NAME%.zip</string>
					<key>url</key>
					<string>%DOWNLOAD_URL%</string>
				</dict>
				<key>Processor</key>
				<string>URLDownloader</string>
			</dict>
			<dict>
				<key>Processor</key>
				<string>EndOfCheckPhase</string>
			</dict>
			<dict>
				<key>Processor</key>
				<string>Unarchiver</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>pattern</key>
					<string>%RECIPE_CACHE_DIR%/%NAME%/*.app</string>
				</dict>
				<key>Processor</key>
				<string>FileFinder</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>input_path</key>
					<string>%found_filename%</string>
					<key>requirement</key>
					<string>identifier "com.motif.framer" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = JZ2M63CZ28</string>
				</dict>
				<key>Processor</key>
				<string>CodeSignatureVerifier</string>
			</dict>
		</array>
	</dict>
</plist>
