<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
  <key>Description</key>
  <string>Downloads the latest ExpanDrive zip file and imports into Munki.</string>
  <key>Identifier</key>
  <string>com.facebook.autopkg.munki.ExpanDrive</string>
  <key>Input</key>
  <dict>
    <key>NAME</key>
    <string>ExpanDrive</string>
    <key>URL</key>
    <string>http://downloads.expandrive.com/branded/facebook/ExpanDrive.zip</string>
    <key>MUNKI_REPO_SUBDIR</key>
    <string>apps/ExpanDrive</string>
    <key>pkginfo</key>
    <dict>
      <key>catalogs</key>
      <array>
        <string>testing</string>
      </array>
      <key>category</key>
      <string>Productivity</string>
      <key>description</key>
      <string>Creates virtual drives for Amazon S3 and FTP/FTPS/SFTP
      connections.</string>
      <key>developer</key>
      <string>ExpanDrive</string>
      <key>display_name</key>
      <string>ExpanDrive</string>
      <key>name</key>
      <string>%NAME%</string>
      <key>unattended_install</key>
      <true/>
    </dict>
  </dict>
  <key>MinimumVersion</key>
  <string>0.2.0</string>
  <key>ParentRecipe</key>
  <string>com.facebook.autopkg.download.expandrive</string>
  <key>Process</key>
  <array>
    <dict>
      <key>Arguments</key>
      <dict>
        <key>destination_path</key>
        <string>%RECIPE_CACHE_DIR%/%NAME%</string>
      </dict>
      <key>Processor</key>
      <string>Unarchiver</string>
    </dict>
    <dict>
      <key>Arguments</key>
      <dict>
        <key>pattern</key>
        <string>%RECIPE_CACHE_DIR%/%NAME%/*.app</string>
      </dict>
      <key>Processor</key>
      <string>FileFinder</string>
    </dict>
    <dict>
      <key>Arguments</key>
      <dict>
        <key>plist_keys</key>
        <dict>
          <key>CFBundleVersion</key>
          <string>version</string>
        </dict>
        <key>info_path</key>
        <string>%found_filename%</string>
      </dict>
      <key>Processor</key>
      <string>PlistReader</string>
    </dict>
    <dict>
      <key>Arguments</key>
      <dict>
        <key>dmg_root</key>
        <string>%RECIPE_CACHE_DIR%/%NAME%</string>
        <key>dmg_path</key>
        <string>%RECIPE_CACHE_DIR%/%NAME%-%version%.dmg</string>
      </dict>
      <key>Processor</key>
      <string>DmgCreator</string>
    </dict>
    <dict>
      <key>Arguments</key>
      <dict>
        <key>additional_pkginfo</key>
        <dict>
          <key>version</key>
          <string>%version%</string>
        </dict>
      </dict>
      <key>Processor</key>
      <string>MunkiPkginfoMerger</string>
    </dict>
    <dict>
      <key>Arguments</key>
      <dict>
        <key>pkg_path</key>
        <string>%RECIPE_CACHE_DIR%/%NAME%-%version%.dmg</string>
        <key>repo_subdirectory</key>
        <string>%MUNKI_REPO_SUBDIR%</string>
      </dict>
      <key>Processor</key>
      <string>MunkiImporter</string>
    </dict>
  </array>
</dict>
</plist>
