<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<!-- Copyright (c) Facebook, Inc. and its affiliates. All Rights Reserved -->
<dict>
    <key>Description</key>
    <string>Downloads latest release of BlueJeans.</string>
    <key>Identifier</key>
    <string>com.facebook.autopkg.download.bluejeans</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>BlueJeans</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://swdl.bluejeans.com/desktop/mac/live.json</string>
                <key>re_pattern</key>
                <string>https://swdl\.bluejeans\.com/desktop/mac/[0-9.]*/[0-9.]*/BlueJeans\.[0-9.]*.pkg</string>
            </dict>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%match%</string>
            </dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>