<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<!-- Copyright (c) Facebook, Inc. and its affiliates. All Rights Reserved -->
<dict>
  <key>Description</key>
  <string>Imports the latest release of BlueJeans into Munki.</string>
  <key>Identifier</key>
  <string>com.facebook.autopkg.munki.bluejeans</string>
  <key>Input</key>
  <dict>
    <key>NAME</key>
    <string>BlueJeans</string>
    <key>MUNKI_REPO_SUBDIR</key>
    <string>apps/%NAME%</string>
    <key>pkginfo</key>
    <dict>
      <key>catalogs</key>
      <array>
        <string>testing</string>
      </array>
      <key>description</key>
      <string>As an alternate to the browser plugin, Mac and Windows users can participate in live meetings using the Blue Jeans desktop app. This app will download automatically when you choose the Desktop App connection option to join a Blue Jeans meeting.

With the Blue Jeans desktop app, you can:

Host and join live meetings
Start an instant meeting
See and share video, audio, and content</string>
      <key>display_name</key>
      <string>Blue Jeans</string>
      <key>category</key>
      <string>Productivity</string>
      <key>developer</key>
      <string>BlueJeans</string>
      <key>unattended_install</key>
      <true/>
      <key>name</key>
      <string>%NAME%</string>  
    </dict>
  </dict>
  <key>MinimumVersion</key>
  <string>0.2.0</string>
  <key>ParentRecipe</key>
  <string>com.facebook.autopkg.download.bluejeans</string>
  <key>Process</key>
  <array>
    <dict>
      <key>Processor</key>
      <string>FlatPkgUnpacker</string>
      <key>Arguments</key>
      <dict>
        <key>flat_pkg_path</key>
        <string>%pathname%</string>
        <key>destination_path</key>
        <string>%RECIPE_CACHE_DIR%/unpack</string>
      </dict>
    </dict>
    <dict>
      <key>Processor</key>
      <string>PkgRootCreator</string>
      <key>Arguments</key>
      <dict>
        <key>pkgroot</key>
        <string>%RECIPE_CACHE_DIR%/BlueJeans</string>
        <key>pkgdirs</key>
        <dict/>
      </dict>
    </dict>
    <dict>
      <key>Processor</key>
      <string>PkgPayloadUnpacker</string>
      <key>Arguments</key>
      <dict>
        <key>destination_path</key>
        <string>%pkgroot%</string>
        <key>pkg_payload_path</key>
        <string>%RECIPE_CACHE_DIR%/unpack/BlueJeansSetup.pkg/Payload</string>
        <key>purge_destination</key>
        <true/>
      </dict>
    </dict>
    <dict>
      <key>Processor</key>
      <string>PlistReader</string>
      <key>Arguments</key>
      <dict>
        <key>info_path</key>
        <string>%pkgroot%/Blue Jeans.app</string>
      </dict>
    </dict>
    <dict>
      <key>Processor</key>
      <string>DmgCreator</string>
      <key>Arguments</key>
      <dict>
        <key>dmg_root</key>
        <string>%pkgroot%</string>
        <key>dmg_path</key>
        <string>%RECIPE_CACHE_DIR%/%NAME%.dmg</string>
      </dict>
    </dict>
    <dict>
      <key>Processor</key>
      <string>MunkiPkginfoMerger</string>
      <key>Arguments</key>
      <dict>
        <key>additional_pkginfo</key>
        <dict>
          <key>version</key>
          <string>%version%</string>
        </dict>
      </dict>
    </dict>
    <dict>
      <key>Processor</key>
      <string>MunkiImporter</string>
      <key>Arguments</key>
      <dict>
        <key>repo_subdirectory</key>
        <string>%MUNKI_REPO_SUBDIR%</string>
        <key>pkg_path</key>
        <string>%RECIPE_CACHE_DIR%/%NAME%.dmg</string>
      </dict>
    </dict>
  </array>
</dict>
</plist>