<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Copyright</key>
		<string>Copyright (c) Facebook, Inc. and its affiliates. All Rights Reserved</string>
		<key>Description</key>
		<string>Creates a package containing the Android SDK.</string>
		<key>Identifier</key>
		<string>com.facebook.autopkg.pkg.android_sdk.minimal</string>
		<key>Input</key>
		<dict>
			<key>NAME</key>
			<string>android_sdk</string>
		</dict>
		<key>MinimumVersion</key>
		<string>0.2.0</string>
		<key>ParentRecipe</key>
		<string>com.facebook.autopkg.download.android_sdk.minimal</string>
		<key>Process</key>
		<array>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>pkgdirs</key>
					<dict>
						<key>opt</key>
						<string>0755</string>
					</dict>
					<key>pkgroot</key>
					<string>%RECIPE_CACHE_DIR%/%NAME%</string>
				</dict>
				<key>Processor</key>
				<string>PkgRootCreator</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>pattern</key>
					<string>%RECIPE_CACHE_DIR%/downloads/sdk/android-sdk*.zip</string>
				</dict>
				<key>Comment</key>
				<string>ANDROID SDK MASTER - Find the SDK master first</string>
				<key>Processor</key>
				<string>FileFinder</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>archive_path</key>
					<string>%found_filename%</string>
					<key>destination_path</key>
					<string>%RECIPE_CACHE_DIR%/unpack/sdk</string>
				</dict>
				<key>Comment</key>
				<string>ANDROID SDK MASTER - Unpack</string>
				<key>Processor</key>
				<string>Unarchiver</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>destination_path</key>
					<string>%pkgroot%/opt/android_sdk</string>
					<key>source_path</key>
					<string>%RECIPE_CACHE_DIR%/unpack/sdk/*</string>
				</dict>
				<key>Comment</key>
				<string>ANDROID SDK MASTER - Copy</string>
				<key>Processor</key>
				<string>Copier</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>pattern</key>
					<string>%RECIPE_CACHE_DIR%/downloads/build/build-tools*.zip</string>
				</dict>
				<key>Comment</key>
				<string>BUILD TOOLS - Find</string>
				<key>Processor</key>
				<string>FileFinder</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>archive_path</key>
					<string>%found_filename%</string>
					<key>destination_path</key>
					<string>%RECIPE_CACHE_DIR%/unpack/build</string>
				</dict>
				<key>Comment</key>
				<string>BUILD TOOLS - Unpack</string>
				<key>Processor</key>
				<string>Unarchiver</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>destination_path</key>
					<string>%pkgroot%/opt/android_sdk/build-tools/23.0.0</string>
					<key>source_path</key>
					<string>%RECIPE_CACHE_DIR%/unpack/build/*</string>
				</dict>
				<key>Comment</key>
				<string>BUILD TOOLS - Copy</string>
				<key>Processor</key>
				<string>Copier</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>pattern</key>
					<string>%RECIPE_CACHE_DIR%/downloads/platform_tools/*.zip</string>
				</dict>
				<key>Comment</key>
				<string>PLATFORM TOOLS - Find</string>
				<key>Processor</key>
				<string>FileFinder</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>archive_path</key>
					<string>%found_filename%</string>
					<key>destination_path</key>
					<string>%pkgroot%/opt/android_sdk/</string>
				</dict>
				<key>Comment</key>
				<string>PLATFORM TOOLS - Unpack</string>
				<key>Processor</key>
				<string>Unarchiver</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>pattern</key>
					<string>%RECIPE_CACHE_DIR%/downloads/platforms/android*.zip</string>
				</dict>
				<key>Comment</key>
				<string>SDK PLATFORMS - Find</string>
				<key>Processor</key>
				<string>FileFinder</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>archive_path</key>
					<string>%found_filename%</string>
					<key>destination_path</key>
					<string>%RECIPE_CACHE_DIR%/unpack/platforms</string>
				</dict>
				<key>Comment</key>
				<string>SDK PLATFORMS - Unpack</string>
				<key>Processor</key>
				<string>Unarchiver</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>destination_path</key>
					<string>%pkgroot%/opt/android_sdk/platforms/android-23</string>
					<key>source_path</key>
					<string>%RECIPE_CACHE_DIR%/unpack/platforms/*</string>
				</dict>
				<key>Comment</key>
				<string>SDK PLATFORMS - Copy</string>
				<key>Processor</key>
				<string>Copier</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>pattern</key>
					<string>%RECIPE_CACHE_DIR%/downloads/apis/*apis*.zip</string>
				</dict>
				<key>Comment</key>
				<string>GOOGLE APIS - Find</string>
				<key>Processor</key>
				<string>FileFinder</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>archive_path</key>
					<string>%found_filename%</string>
					<key>destination_path</key>
					<string>%RECIPE_CACHE_DIR%/unpack/apis</string>
				</dict>
				<key>Comment</key>
				<string>GOOGLE APIS - Unpack</string>
				<key>Processor</key>
				<string>Unarchiver</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>destination_path</key>
					<string>%pkgroot%/opt/android_sdk/add-ons/addon-google_apis-google-23</string>
					<key>overwrite</key>
					<true/>
					<key>source_path</key>
					<string>%RECIPE_CACHE_DIR%/unpack/apis/*</string>
				</dict>
				<key>Comment</key>
				<string>GOOGLE APIS - Copy</string>
				<key>Processor</key>
				<string>Copier</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>namespace</key>
					<string>add-on</string>
					<key>tags</key>
					<dict>
						<key>api-level</key>
						<string>AndroidVersionApiLevel</string>
						<key>description</key>
						<string>PkgDesc</string>
						<key>license</key>
						<string>PkgLicense</string>
						<key>name-display</key>
						<string>AddonNameDisplay</string>
						<key>name-id</key>
						<string>AddonNameID</string>
						<key>revision</key>
						<string>PkgRevision</string>
						<key>uses-license</key>
						<string>PkgLicenseRef</string>
						<key>vendor-display</key>
						<string>AddonVendorDisplay</string>
						<key>vendor-id</key>
						<string>AddonVendorID</string>
					</dict>
					<key>xml_file</key>
					<string>https://dl.google.com/android/repository/addon.xml</string>
				</dict>
				<key>Processor</key>
				<string>AndroidXMLParser</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>file_path</key>
					<string>%pkgroot%/opt/android_sdk/add-ons/addon-google_apis-google-23/source.properties</string>
					<key>properties</key>
					<dict>
						<key>Addon.NameDisplay</key>
						<string>%AddonNameDisplay%</string>
						<key>Addon.NameId</key>
						<string>%AddonNameID%</string>
						<key>Addon.VendorDisplay</key>
						<string>%AddonVendorDisplay%</string>
						<key>Addon.VendorId</key>
						<string>%AddonVendorID%</string>
						<key>AndroidVersion.ApiLevel</key>
						<string>%AndroidVersionApiLevel%</string>
						<key>Pkg.Desc</key>
						<string>%PkgDesc%</string>
						<key>Pkg.License</key>
						<string>%PkgLicense%</string>
						<key>Pkg.LicenseRef</key>
						<string>%PkgLicenseRef%</string>
						<key>Pkg.Revision</key>
						<string>%PkgRevision%</string>
						<key>Pkg.SourceUrl</key>
						<string>https\://dl.google.com/android/repository/addon.xml</string>
					</dict>
				</dict>
				<key>Processor</key>
				<string>PropertiesWriter</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>archive_path</key>
					<string>%RECIPE_CACHE_DIR%/downloads/apis_extra/google_apis-21_r01.zip</string>
					<key>destination_path</key>
					<string>%RECIPE_CACHE_DIR%/unpack/apis_extra/21</string>
				</dict>
				<key>Comment</key>
				<string>GOOGLE APIS - Unpack</string>
				<key>Processor</key>
				<string>Unarchiver</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>destination_path</key>
					<string>%pkgroot%/opt/android_sdk/add-ons/addon-google_apis-google-21</string>
					<key>overwrite</key>
					<true/>
					<key>source_path</key>
					<string>%RECIPE_CACHE_DIR%/unpack/apis_extra/21/*</string>
				</dict>
				<key>Comment</key>
				<string>GOOGLE APIS - Copy</string>
				<key>Processor</key>
				<string>Copier</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>archive_path</key>
					<string>%RECIPE_CACHE_DIR%/downloads/apis_extra/google_apis-19_r15.zip</string>
					<key>destination_path</key>
					<string>%RECIPE_CACHE_DIR%/unpack/apis_extra/19</string>
				</dict>
				<key>Comment</key>
				<string>GOOGLE APIS - Unpack</string>
				<key>Processor</key>
				<string>Unarchiver</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>destination_path</key>
					<string>%pkgroot%/opt/android_sdk/add-ons/addon-google_apis-google-19</string>
					<key>overwrite</key>
					<true/>
					<key>source_path</key>
					<string>%RECIPE_CACHE_DIR%/unpack/apis_extra/19/*</string>
				</dict>
				<key>Comment</key>
				<string>GOOGLE APIS - Copy</string>
				<key>Processor</key>
				<string>Copier</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>archive_path</key>
					<string>%RECIPE_CACHE_DIR%/downloads/apis_extra/google_apis-18_r04.zip</string>
					<key>destination_path</key>
					<string>%RECIPE_CACHE_DIR%/unpack/apis_extra/18</string>
				</dict>
				<key>Comment</key>
				<string>GOOGLE APIS - Unpack</string>
				<key>Processor</key>
				<string>Unarchiver</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>destination_path</key>
					<string>%pkgroot%/opt/android_sdk/add-ons/addon-google_apis-google-18</string>
					<key>overwrite</key>
					<true/>
					<key>source_path</key>
					<string>%RECIPE_CACHE_DIR%/unpack/apis_extra/18/*</string>
				</dict>
				<key>Comment</key>
				<string>GOOGLE APIS - Copy</string>
				<key>Processor</key>
				<string>Copier</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>archive_path</key>
					<string>%RECIPE_CACHE_DIR%/downloads/apis_extra/google_apis-16_r04.zip</string>
					<key>destination_path</key>
					<string>%RECIPE_CACHE_DIR%/unpack/apis_extra/16</string>
				</dict>
				<key>Comment</key>
				<string>GOOGLE APIS - Unpack</string>
				<key>Processor</key>
				<string>Unarchiver</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>destination_path</key>
					<string>%pkgroot%/opt/android_sdk/add-ons/addon-google_apis-google-16</string>
					<key>overwrite</key>
					<true/>
					<key>source_path</key>
					<string>%RECIPE_CACHE_DIR%/unpack/apis_extra/16/*</string>
				</dict>
				<key>Comment</key>
				<string>GOOGLE APIS - Copy</string>
				<key>Processor</key>
				<string>Copier</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>archive_path</key>
					<string>%RECIPE_CACHE_DIR%/downloads/apis_extra/google_apis-10_r02.zip</string>
					<key>destination_path</key>
					<string>%RECIPE_CACHE_DIR%/unpack/apis_extra/10</string>
				</dict>
				<key>Comment</key>
				<string>GOOGLE APIS - Unpack</string>
				<key>Processor</key>
				<string>Unarchiver</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>destination_path</key>
					<string>%pkgroot%/opt/android_sdk/add-ons/addon-google_apis-google-10</string>
					<key>overwrite</key>
					<true/>
					<key>source_path</key>
					<string>%RECIPE_CACHE_DIR%/unpack/apis_extra/10/*</string>
				</dict>
				<key>Comment</key>
				<string>GOOGLE APIS - Copy</string>
				<key>Processor</key>
				<string>Copier</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>archive_path</key>
					<string>%RECIPE_CACHE_DIR%/downloads/apis_extra/google_apis-8_r02.zip</string>
					<key>destination_path</key>
					<string>%RECIPE_CACHE_DIR%/unpack/apis_extra/8</string>
				</dict>
				<key>Comment</key>
				<string>GOOGLE APIS - Unpack</string>
				<key>Processor</key>
				<string>Unarchiver</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>destination_path</key>
					<string>%pkgroot%/opt/android_sdk/add-ons/addon-google_apis-google-8</string>
					<key>overwrite</key>
					<true/>
					<key>source_path</key>
					<string>%RECIPE_CACHE_DIR%/unpack/apis_extra/8/*</string>
				</dict>
				<key>Comment</key>
				<string>GOOGLE APIS - Copy</string>
				<key>Processor</key>
				<string>Copier</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>pkgdirs</key>
					<dict/>
					<key>pkgroot</key>
					<string>%RECIPE_CACHE_DIR%/%NAME%/opt/android_sdk/temp</string>
				</dict>
				<key>Processor</key>
				<string>PkgRootCreator</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>pkg_request</key>
					<dict>
						<key>chown</key>
						<array>
							<dict>
								<key>group</key>
								<string>wheel</string>
								<key>mode</key>
								<string>0777</string>
								<key>path</key>
								<string>opt/android_sdk</string>
								<key>user</key>
								<string>root</string>
							</dict>
							<dict>
								<key>group</key>
								<string>wheel</string>
								<key>mode</key>
								<string>0777</string>
								<key>path</key>
								<string>opt/android_sdk/temp</string>
								<key>user</key>
								<string>root</string>
							</dict>
						</array>
						<key>id</key>
						<string>com.facebook.pkg.androidsdk.complete</string>
						<key>options</key>
						<string>purge_ds_store</string>
						<key>pkgdir</key>
						<string>%RECIPE_CACHE_DIR%</string>
					</dict>
					<key>pkgname</key>
					<string>%NAME%-%version%</string>
					<key>pkgroot</key>
					<string>%RECIPE_CACHE_DIR%/%NAME%</string>
				</dict>
				<key>Processor</key>
				<string>PkgCreator</string>
			</dict>
		</array>
	</dict>
</plist>
