<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Copyright</key>
    <string>Copyright (c) Facebook, Inc. and its affiliates. All Rights Reserved</string>
  <key>Description</key>
  <string>Creates a package containing the Android SDK.</string>
  <key>Identifier</key>
  <string>com.facebook.autopkg.pkg.android_sdk.minimal</string>
  <key>Input</key>
  <dict>
    <key>NAME</key>
    <string>android_sdk</string>
  </dict>
  <key>MinimumVersion</key>
  <string>0.2.0</string>
  <key>ParentRecipe</key>
  <string>com.facebook.autopkg.download.android_sdk.minimal</string>
  <key>Process</key>
  <array>
    <dict>
      <key>Processor</key>
      <string>PkgRootCreator</string>
      <key>Arguments</key>
      <dict>
        <key>pkgroot</key>
        <string>%RECIPE_CACHE_DIR%/%NAME%</string>
        <key>pkgdirs</key>
        <dict>
          <key>opt</key>
          <string>0755</string>
        </dict>
      </dict>
    </dict>
  <!-- Unpack the Android SDK master first -->
    <dict>
      <key>Processor</key>
      <string>FileFinder</string>
      <key>Comment</key>
      <string>ANDROID SDK MASTER - Find the SDK master first</string>
      <key>Arguments</key>
      <dict>
        <key>pattern</key>
        <string>%RECIPE_CACHE_DIR%/downloads/sdk/android-sdk*.zip</string>
      </dict>
    </dict>
    <dict>
      <key>Processor</key>
      <string>Unarchiver</string>
      <key>Comment</key>
      <string>ANDROID SDK MASTER - Unpack</string>
      <key>Arguments</key>
      <dict>
        <key>destination_path</key>
        <string>%RECIPE_CACHE_DIR%/unpack/sdk</string>
        <key>archive_path</key>
        <string>%found_filename%</string>
      </dict>
    </dict>
    <dict>
      <key>Processor</key>
      <string>Copier</string>
      <key>Comment</key>
      <string>ANDROID SDK MASTER - Copy</string>
      <key>Arguments</key>
      <dict>
        <key>source_path</key>
        <string>%RECIPE_CACHE_DIR%/unpack/sdk/*</string>
        <key>destination_path</key>
        <string>%pkgroot%/opt/android_sdk</string>
      </dict>
    </dict>
  <!-- Build Tools -->
    <dict>
      <key>Processor</key>
      <string>FileFinder</string>
      <key>Comment</key>
      <string>BUILD TOOLS - Find</string>
      <key>Arguments</key>
      <dict>
        <key>pattern</key>
        <string>%RECIPE_CACHE_DIR%/downloads/build/build-tools*.zip</string>
      </dict>
    </dict>
    <dict>
      <key>Processor</key>
      <string>Unarchiver</string>
      <key>Comment</key>
      <string>BUILD TOOLS - Unpack</string>
      <key>Arguments</key>
      <dict>
        <key>destination_path</key>
        <string>%RECIPE_CACHE_DIR%/unpack/build</string>
        <key>archive_path</key>
        <string>%found_filename%</string>
      </dict>
    </dict>
    <dict>
      <key>Processor</key>
      <string>Copier</string>
      <key>Comment</key>
      <string>BUILD TOOLS - Copy</string>
      <key>Arguments</key>
      <dict>
        <key>source_path</key>
        <string>%RECIPE_CACHE_DIR%/unpack/build/*</string>
        <key>destination_path</key>
        <string>%pkgroot%/opt/android_sdk/build-tools/23.0.0</string>
      </dict>
    </dict>
  <!-- Platform Tools -->
    <dict>
      <key>Processor</key>
      <string>FileFinder</string>
      <key>Comment</key>
      <string>PLATFORM TOOLS - Find</string>
      <key>Arguments</key>
      <dict>
        <key>pattern</key>
        <string>%RECIPE_CACHE_DIR%/downloads/platform_tools/*.zip</string>
      </dict>
    </dict>
    <dict>
      <key>Processor</key>
      <string>Unarchiver</string>
      <key>Comment</key>
      <string>PLATFORM TOOLS - Unpack</string>
      <key>Arguments</key>
      <dict>
        <key>destination_path</key>
        <string>%pkgroot%/opt/android_sdk/</string>
        <key>archive_path</key>
        <string>%found_filename%</string>
      </dict>
    </dict>
  <!-- SDK platform -->
    <dict>
      <key>Processor</key>
      <string>FileFinder</string>
      <key>Comment</key>
      <string>SDK PLATFORMS - Find</string>
      <key>Arguments</key>
      <dict>
        <key>pattern</key>
        <string>%RECIPE_CACHE_DIR%/downloads/platforms/android*.zip</string>
      </dict>
    </dict>
    <dict>
      <key>Processor</key>
      <string>Unarchiver</string>
      <key>Comment</key>
      <string>SDK PLATFORMS - Unpack</string>
      <key>Arguments</key>
      <dict>
        <key>destination_path</key>
        <string>%RECIPE_CACHE_DIR%/unpack/platforms</string>
        <key>archive_path</key>
        <string>%found_filename%</string>
      </dict>
    </dict>
    <dict>
      <key>Processor</key>
      <string>Copier</string>
      <key>Comment</key>
      <string>SDK PLATFORMS - Copy</string>
      <key>Arguments</key>
      <dict>
        <key>source_path</key>
        <string>%RECIPE_CACHE_DIR%/unpack/platforms/*</string>
        <key>destination_path</key>
        <string>%pkgroot%/opt/android_sdk/platforms/android-23</string>
      </dict>
    </dict>
  <!-- Google APIs -->
    <dict>
      <key>Processor</key>
      <string>FileFinder</string>
      <key>Comment</key>
      <string>GOOGLE APIS - Find</string>
      <key>Arguments</key>
      <dict>
        <key>pattern</key>
        <string>%RECIPE_CACHE_DIR%/downloads/apis/*apis*.zip</string>
      </dict>
    </dict>
    <dict>
      <key>Processor</key>
      <string>Unarchiver</string>
      <key>Comment</key>
      <string>GOOGLE APIS - Unpack</string>
      <key>Arguments</key>
      <dict>
        <key>destination_path</key>
        <string>%RECIPE_CACHE_DIR%/unpack/apis</string>
        <key>archive_path</key>
        <string>%found_filename%</string>
      </dict>
    </dict>
    <dict>
      <key>Processor</key>
      <string>Copier</string>
      <key>Comment</key>
      <string>GOOGLE APIS - Copy</string>
      <key>Arguments</key>
      <dict>
        <key>source_path</key>
        <string>%RECIPE_CACHE_DIR%/unpack/apis/*</string>
        <key>destination_path</key>
        <string>%pkgroot%/opt/android_sdk/add-ons/addon-google_apis-google-23</string>
        <key>overwrite</key>
        <true/>
      </dict>
    </dict>
    <!-- Create the source.properties file for Google APIs -->
    <dict>
      <key>Processor</key>
      <string>AndroidXMLParser</string>
      <key>Arguments</key>
      <dict>
        <key>xml_file</key>
        <string>https://dl.google.com/android/repository/addon.xml</string>
        <key>namespace</key>
        <string>add-on</string>
        <key>tags</key>
        <dict>
          <key>vendor-display</key>
          <string>AddonVendorDisplay</string>
          <key>vendor-id</key>
          <string>AddonVendorID</string>
          <key>name-display</key>
          <string>AddonNameDisplay</string>
          <key>name-id</key>
          <string>AddonNameID</string>
          <key>api-level</key>
          <string>AndroidVersionApiLevel</string>
          <key>description</key>
          <string>PkgDesc</string>
          <key>license</key>
          <string>PkgLicense</string>
          <key>uses-license</key>
          <string>PkgLicenseRef</string>
          <key>revision</key>
          <string>PkgRevision</string>
        </dict>
      </dict>
    </dict>
    <dict>
      <key>Processor</key>
      <string>PropertiesWriter</string>
      <key>Arguments</key>
      <dict>
        <key>file_path</key>
        <string>%pkgroot%/opt/android_sdk/add-ons/addon-google_apis-google-23/source.properties</string>
        <key>properties</key>
        <dict>
          <key>Addon.NameDisplay</key>
          <string>%AddonNameDisplay%</string>
          <key>Addon.NameId</key>
          <string>%AddonNameID%</string>
          <key>Addon.VendorDisplay</key>
          <string>%AddonVendorDisplay%</string>
          <key>Addon.VendorId</key>
          <string>%AddonVendorID%</string>
          <key>AndroidVersion.ApiLevel</key>
          <string>%AndroidVersionApiLevel%</string>
          <key>Pkg.Desc</key>
          <string>%PkgDesc%</string>
          <key>Pkg.License</key>
          <string>%PkgLicense%</string>
          <key>Pkg.LicenseRef</key>
          <string>%PkgLicenseRef%</string>
          <key>Pkg.Revision</key>
          <string>%PkgRevision%</string>
          <key>Pkg.SourceUrl</key>
          <string>https\://dl.google.com/android/repository/addon.xml</string>
        </dict>
      </dict>
    </dict>
  <!-- Special API requests -->
    <!-- API 21 -->
    <dict>
      <key>Processor</key>
      <string>Unarchiver</string>
      <key>Comment</key>
      <string>GOOGLE APIS - Unpack</string>
      <key>Arguments</key>
      <dict>
        <key>destination_path</key>
        <string>%RECIPE_CACHE_DIR%/unpack/apis_extra/21</string>
        <key>archive_path</key>
        <string>%RECIPE_CACHE_DIR%/downloads/apis_extra/google_apis-21_r01.zip</string>
      </dict>
    </dict>
    <dict>
      <key>Processor</key>
      <string>Copier</string>
      <key>Comment</key>
      <string>GOOGLE APIS - Copy</string>
      <key>Arguments</key>
      <dict>
        <key>source_path</key>
        <string>%RECIPE_CACHE_DIR%/unpack/apis_extra/21/*</string>
        <key>destination_path</key>
        <string>%pkgroot%/opt/android_sdk/add-ons/addon-google_apis-google-21</string>
        <key>overwrite</key>
        <true/>
      </dict>
    </dict>
    <!-- API 19 -->
    <dict>
      <key>Processor</key>
      <string>Unarchiver</string>
      <key>Comment</key>
      <string>GOOGLE APIS - Unpack</string>
      <key>Arguments</key>
      <dict>
        <key>destination_path</key>
        <string>%RECIPE_CACHE_DIR%/unpack/apis_extra/19</string>
        <key>archive_path</key>
        <string>%RECIPE_CACHE_DIR%/downloads/apis_extra/google_apis-19_r15.zip</string>
      </dict>
    </dict>
    <dict>
      <key>Processor</key>
      <string>Copier</string>
      <key>Comment</key>
      <string>GOOGLE APIS - Copy</string>
      <key>Arguments</key>
      <dict>
        <key>source_path</key>
        <string>%RECIPE_CACHE_DIR%/unpack/apis_extra/19/*</string>
        <key>destination_path</key>
        <string>%pkgroot%/opt/android_sdk/add-ons/addon-google_apis-google-19</string>
        <key>overwrite</key>
        <true/>
      </dict>
    </dict>
    <!-- API 18 -->
    <dict>
      <key>Processor</key>
      <string>Unarchiver</string>
      <key>Comment</key>
      <string>GOOGLE APIS - Unpack</string>
      <key>Arguments</key>
      <dict>
        <key>destination_path</key>
        <string>%RECIPE_CACHE_DIR%/unpack/apis_extra/18</string>
        <key>archive_path</key>
        <string>%RECIPE_CACHE_DIR%/downloads/apis_extra/google_apis-18_r04.zip</string>
      </dict>
    </dict>
    <dict>
      <key>Processor</key>
      <string>Copier</string>
      <key>Comment</key>
      <string>GOOGLE APIS - Copy</string>
      <key>Arguments</key>
      <dict>
        <key>source_path</key>
        <string>%RECIPE_CACHE_DIR%/unpack/apis_extra/18/*</string>
        <key>destination_path</key>
        <string>%pkgroot%/opt/android_sdk/add-ons/addon-google_apis-google-18</string>
        <key>overwrite</key>
        <true/>
      </dict>
    </dict>
    <!-- API 16 -->
    <dict>
      <key>Processor</key>
      <string>Unarchiver</string>
      <key>Comment</key>
      <string>GOOGLE APIS - Unpack</string>
      <key>Arguments</key>
      <dict>
        <key>destination_path</key>
        <string>%RECIPE_CACHE_DIR%/unpack/apis_extra/16</string>
        <key>archive_path</key>
        <string>%RECIPE_CACHE_DIR%/downloads/apis_extra/google_apis-16_r04.zip</string>
      </dict>
    </dict>
    <dict>
      <key>Processor</key>
      <string>Copier</string>
      <key>Comment</key>
      <string>GOOGLE APIS - Copy</string>
      <key>Arguments</key>
      <dict>
        <key>source_path</key>
        <string>%RECIPE_CACHE_DIR%/unpack/apis_extra/16/*</string>
        <key>destination_path</key>
        <string>%pkgroot%/opt/android_sdk/add-ons/addon-google_apis-google-16</string>
        <key>overwrite</key>
        <true/>
      </dict>
    </dict>
    <!-- API 10 -->
    <dict>
      <key>Processor</key>
      <string>Unarchiver</string>
      <key>Comment</key>
      <string>GOOGLE APIS - Unpack</string>
      <key>Arguments</key>
      <dict>
        <key>destination_path</key>
        <string>%RECIPE_CACHE_DIR%/unpack/apis_extra/10</string>
        <key>archive_path</key>
        <string>%RECIPE_CACHE_DIR%/downloads/apis_extra/google_apis-10_r02.zip</string>
      </dict>
    </dict>
    <dict>
      <key>Processor</key>
      <string>Copier</string>
      <key>Comment</key>
      <string>GOOGLE APIS - Copy</string>
      <key>Arguments</key>
      <dict>
        <key>source_path</key>
        <string>%RECIPE_CACHE_DIR%/unpack/apis_extra/10/*</string>
        <key>destination_path</key>
        <string>%pkgroot%/opt/android_sdk/add-ons/addon-google_apis-google-10</string>
        <key>overwrite</key>
        <true/>
      </dict>
    </dict>
    <!-- API 8 -->
    <dict>
      <key>Processor</key>
      <string>Unarchiver</string>
      <key>Comment</key>
      <string>GOOGLE APIS - Unpack</string>
      <key>Arguments</key>
      <dict>
        <key>destination_path</key>
        <string>%RECIPE_CACHE_DIR%/unpack/apis_extra/8</string>
        <key>archive_path</key>
        <string>%RECIPE_CACHE_DIR%/downloads/apis_extra/google_apis-8_r02.zip</string>
      </dict>
    </dict>
    <dict>
      <key>Processor</key>
      <string>Copier</string>
      <key>Comment</key>
      <string>GOOGLE APIS - Copy</string>
      <key>Arguments</key>
      <dict>
        <key>source_path</key>
        <string>%RECIPE_CACHE_DIR%/unpack/apis_extra/8/*</string>
        <key>destination_path</key>
        <string>%pkgroot%/opt/android_sdk/add-ons/addon-google_apis-google-8</string>
        <key>overwrite</key>
        <true/>
      </dict>
    </dict>
    <!-- Create temp folder for android tools to download into -->
    <dict>
      <key>Processor</key>
      <string>PkgRootCreator</string>
      <key>Arguments</key>
      <dict>
        <key>pkgroot</key>
        <string>%RECIPE_CACHE_DIR%/%NAME%/opt/android_sdk/temp</string>
        <key>pkgdirs</key>
        <dict/>
      </dict>
    </dict>
  <!-- Create PKG -->
    <dict>
      <key>Processor</key>
      <string>PkgCreator</string>
      <key>Arguments</key>
      <dict>
        <key>pkgroot</key>
        <string>%RECIPE_CACHE_DIR%/%NAME%</string>
        <key>pkgname</key>
        <string>%NAME%-%version%</string>
        <key>pkg_request</key>
        <dict>
          <key>pkgdir</key>
          <string>%RECIPE_CACHE_DIR%</string>
          <key>id</key>
          <string>com.facebook.pkg.androidsdk.complete</string>
          <key>options</key>
          <string>purge_ds_store</string>
          <key>chown</key>
          <array>
            <dict>
              <key>path</key>
              <string>opt/android_sdk</string>
              <key>user</key>
              <string>root</string>
              <key>group</key>
              <string>wheel</string>
              <key>mode</key>
              <string>0777</string>
            </dict>
            <dict>
              <key>path</key>
              <string>opt/android_sdk/temp</string>
              <key>user</key>
              <string>root</string>
              <key>group</key>
              <string>wheel</string>
              <key>mode</key>
              <string>0777</string>
            </dict>
          </array>
        </dict>
      </dict>
    </dict>
    <!--
    <dict>
      <key>Processor</key>
      <string>PathDeleter</string>
      <key>Arguments</key>
      <dict>
        <key>path_list</key>
        <array>
          <string>%RECIPE_CACHE_DIR%/unpack</string>
        </array>
      </dict>
    </dict>
  -->
  </array>
</dict>
</plist>
