<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<!-- Copyright (c) Facebook, Inc. and its affiliates. All Rights Reserved -->
<dict>
  <key>Description</key>
  <string>Downloads a minimal set of the latest release of Android SDK.</string>
  <key>Identifier</key>
  <string>com.facebook.autopkg.download.android_sdk.minimal</string>
  <key>Input</key>
  <dict>
    <key>NAME</key>
    <string>android_sdk</string>
  </dict>
  <key>MinimumVersion</key>
  <string>0.5.0</string>
  <key>Process</key>
  <array>
    <dict>
      <key>Processor</key>
      <string>URLTextSearcher</string>
      <key>Arguments</key>
      <dict>
        <key>url</key>
        <string>https://developer.android.com/sdk/index.html#Other</string>
        <key>re_pattern</key>
        <string>"(http:\/\/dl.google.com\/.*\/.*macosx.zip)"</string>
      </dict>
    </dict>
    <dict>
      <key>Arguments</key>
      <dict>
        <key>url</key>
        <string>%match%</string>
        <key>download_dir</key>
        <string>%RECIPE_CACHE_DIR%/downloads/sdk</string>
      </dict>
      <key>Processor</key>
      <string>URLDownloader</string>
    </dict>
    <!-- Version is based off the SDK tools -->
    <dict>
      <key>Processor</key>
      <string>AndroidSDKVersioner</string>
      <key>Arguments</key>
      <dict>
        <key>xml_file</key>
        <string>https://dl.google.com/android/repository/repository-11.xml</string>
      </dict>
    </dict>
    <!-- Android SDK Platform -->
    <dict>
      <key>Processor</key>
      <string>AndroidXMLParser</string>
      <key>Arguments</key>
      <dict>
        <key>xml_file</key>
        <string>https://dl.google.com/android/repository/repository-11.xml</string>
        <key>namespace</key>
        <string>platform</string>
        <key>tags</key>
        <dict>
          <key>url</key>
          <string>found_value</string>
        </dict>
      </dict>
    </dict>
    <dict>
      <key>Arguments</key>
      <dict>
        <key>url</key>
        <string>http://dl.google.com/android/repository/%found_value%</string>
        <key>download_dir</key>
        <string>%RECIPE_CACHE_DIR%/downloads/platforms</string>
      </dict>
      <key>Processor</key>
      <string>URLDownloader</string>
      <key>Comment</key>
      <string>Android SDK Platform</string>
    </dict>
    <!-- Platform tools -->
    <dict>
      <key>Processor</key>
      <string>AndroidXMLParser</string>
      <key>Arguments</key>
      <dict>
        <key>xml_file</key>
        <string>https://dl.google.com/android/repository/repository-11.xml</string>
        <key>namespace</key>
        <string>platform-tool</string>
        <key>tags</key>
        <dict>
          <key>url</key>
          <string>found_value</string>
        </dict>
      </dict>
    </dict>
    <dict>
      <key>Arguments</key>
      <dict>
        <key>url</key>
        <string>http://dl.google.com/android/repository/%found_value%</string>
        <key>download_dir</key>
        <string>%RECIPE_CACHE_DIR%/downloads/platform_tools</string>
      </dict>
      <key>Processor</key>
      <string>URLDownloader</string>
      <key>Comment</key>
      <string>Android SDK Platform Tools</string>
    </dict>
    <!-- Build tools -->
    <dict>
      <key>Processor</key>
      <string>AndroidXMLParser</string>
      <key>Arguments</key>
      <dict>
        <key>xml_file</key>
        <string>https://dl.google.com/android/repository/repository-11.xml</string>
        <key>namespace</key>
        <string>build-tool</string>
        <key>tags</key>
        <dict>
          <key>url</key>
          <string>found_value</string>
        </dict>
      </dict>
    </dict>
    <dict>
      <key>Arguments</key>
      <dict>
        <key>url</key>
        <string>http://dl.google.com/android/repository/%found_value%</string>
        <key>download_dir</key>
        <string>%RECIPE_CACHE_DIR%/downloads/build</string>
      </dict>
      <key>Processor</key>
      <string>URLDownloader</string>
      <key>Comment</key>
      <string>Android SDK Build Tools</string>
    </dict>
    <!-- APIs -->
    <dict>
      <key>Processor</key>
      <string>AndroidXMLParser</string>
      <key>Arguments</key>
      <dict>
        <key>xml_file</key>
        <string>https://dl.google.com/android/repository/addon.xml</string>
        <key>namespace</key>
        <string>add-on</string>
        <key>tags</key>
        <dict>
          <key>url</key>
          <string>found_value</string>
        </dict>
      </dict>
    </dict>
    <dict>
      <key>Arguments</key>
      <dict>
        <key>url</key>
        <string>http://dl.google.com/android/repository/%found_value%</string>
        <key>download_dir</key>
        <string>%RECIPE_CACHE_DIR%/downloads/apis</string>
      </dict>
      <key>Processor</key>
      <string>URLDownloader</string>
      <key>Comment</key>
      <string>Google APIs</string>
    </dict>
    <!-- Specific APIs by request -->
    <dict>
      <key>Arguments</key>
      <dict>
        <key>url</key>
        <string>http://dl.google.com/android/repository/google_apis-21_r01.zip</string>
        <key>download_dir</key>
        <string>%RECIPE_CACHE_DIR%/downloads/apis_extra</string>
      </dict>
      <key>Processor</key>
      <string>URLDownloader</string>
      <key>Comment</key>
      <string>Google APIs - 21r1</string>
    </dict>
    <dict>
      <key>Arguments</key>
      <dict>
        <key>url</key>
        <string>http://dl.google.com/android/repository/google_apis-19_r15.zip</string>
        <key>download_dir</key>
        <string>%RECIPE_CACHE_DIR%/downloads/apis_extra</string>
      </dict>
      <key>Processor</key>
      <string>URLDownloader</string>
      <key>Comment</key>
      <string>Google APIs - 19r15</string>
    </dict>
    <dict>
      <key>Arguments</key>
      <dict>
        <key>url</key>
        <string>http://dl.google.com/android/repository/google_apis-18_r04.zip</string>
        <key>download_dir</key>
        <string>%RECIPE_CACHE_DIR%/downloads/apis_extra</string>
      </dict>
      <key>Processor</key>
      <string>URLDownloader</string>
      <key>Comment</key>
      <string>Google APIs - 18r4</string>
    </dict>
    <dict>
      <key>Arguments</key>
      <dict>
        <key>url</key>
        <string>http://dl.google.com/android/repository/google_apis-16_r04.zip</string>
        <key>download_dir</key>
        <string>%RECIPE_CACHE_DIR%/downloads/apis_extra</string>
      </dict>
      <key>Processor</key>
      <string>URLDownloader</string>
      <key>Comment</key>
      <string>Google APIs - 16r4</string>
    </dict>
    <dict>
      <key>Arguments</key>
      <dict>
        <key>url</key>
        <string>http://dl.google.com/android/repository/google_apis-10_r02.zip</string>
        <key>download_dir</key>
        <string>%RECIPE_CACHE_DIR%/downloads/apis_extra</string>
      </dict>
      <key>Processor</key>
      <string>URLDownloader</string>
      <key>Comment</key>
      <string>Google APIs - 10r2</string>
    </dict>
    <dict>
      <key>Arguments</key>
      <dict>
        <key>url</key>
        <string>http://dl.google.com/android/repository/google_apis-8_r02.zip</string>
        <key>download_dir</key>
        <string>%RECIPE_CACHE_DIR%/downloads/apis_extra</string>
      </dict>
      <key>Processor</key>
      <string>URLDownloader</string>
      <key>Comment</key>
      <string>Google APIs - 8r2</string>
    </dict>
    <!-- Done -->
    <dict>
      <key>Processor</key>
      <string>EndOfCheckPhase</string>
    </dict>
  </array>
</dict>
</plist>