<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Copyright</key>
        <string>Copyright (c) Facebook, Inc. and its affiliates. All Rights Reserved</string>
        <key>Description</key>
        <string>Downloads a minimal set of the latest release of Android SDK.</string>
        <key>Identifier</key>
        <string>com.facebook.autopkg.download.android_sdk.minimal</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>android_sdk</string>
        </dict>
        <key>MinimumVersion</key>
        <string>0.5.0</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Processor</key>
                <string>DeprecationWarning</string>
                <key>Arguments</key>
                <dict>
                    <key>warning_message</key>
                    <string>These recipes have moved into nmcspadden-recipes, and the identifiers have changed. Please update your overrides!</string>
                </dict>
            </dict>
        </array>
    </dict>
</plist>
