<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Imports the LastPass Enterprise package for Safari into Munki.</string>
    <key>Identifier</key>
    <string>com.facebook.autopkg.munki.lastpass.safari</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>LastPass</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/LastPass</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>   
                <string>testing</string>
            </array>
            <key>description</key>
            <string>Only remember one password - your LastPass master password. Save all your usernames and passwords to LastPass, and it will autologin to your sites and sync your data everywhere you need it.</string>
            <key>display_name</key>
            <string>LastPass - Safari</string>
            <key>name</key>
            <string>%NAME%-Safari</string>
            <key>postinstall_script</key>
            <string>#!/bin/bash
/Library/CPE/lib/flib/scripts/pyexec /Library/CPE/lib/flib/scripts/munki_postinstall_lastpass-safari.py
</string>
            <key>icon_name</key>
            <string>LastPass.png</string>
            <key>category</key>
            <string>Productivity</string>
            <key>developer</key>
            <string>Lastpass</string>
            <key>unattended_install</key>
            <true/>
        </dict>
    </dict>
    <key>ParentRecipe</key>
    <string>com.facebook.autopkg.pkg.lastpass.safari</string>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%RECIPE_CACHE_DIR%/LastPass-Safari.pkg</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>