<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Packages the latest version of LastPass Enterprise's Firefox extension customized for Facebook.</string>
    <key>Identifier</key>
    <string>com.facebook.autopkg.pkg.lastpass.firefox</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>LastPass</string>
        <key>FFAUTOCONFIGPATH</key>
        <string>autoconfig</string>
    </dict>
    <key>ParentRecipe</key>
    <string>com.facebook.autopkg.download.lastpass</string>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>Unarchiver</string>
            <key>Arguments</key>
            <dict>
                <key>purge_destination</key>
                <true/>
            </dict>
        </dict>
        <!--
            Firefox:
                Aggressive option:
                    Incorporate Autoconfig into Firefox
                Less aggressive option:
                    Extract CCK generated AutoConfig.zip into Firefox.app/Contents/Resources/
        -->
        <dict>
            <key>Processor</key>
            <string>PkgRootCreator</string>
            <key>Arguments</key>
            <dict>
                <key>pkgroot</key>
                <string>%RECIPE_CACHE_DIR%/Firefox</string>
                <key>pkgdirs</key>
                <dict>
                    <key>Applications</key>
                    <string>0775</string>
                    <key>Applications/Firefox.app</key>
                    <string>0775</string>
                    <key>Applications/Firefox.app/Contents</key>
                    <string>0775</string>
                </dict>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Copier</string>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>%RECIPE_DIR%/%FFAUTOCONFIGPATH%</string>
                <key>destination_path</key>
                <string>%pkgroot%/Applications/Firefox.app/Contents/Resources</string>
                <key>overwrite</key>
                <true/>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Unarchiver</string>
            <key>Arguments</key>
            <dict>
                <key>archive_path</key>
                <string>%pkgroot%/Applications/Firefox.app/Contents/Resources/cck2/resources/addons/lp.xpi</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/XPI_decompressed</string>
                <key>archive_format</key>
                <string>zip</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>LastPassFirefoxXPIVersioner</string>
            <key>Arguments</key>
            <dict/>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PkgCreator</string>
            <key>Arguments</key>
            <dict>
                <key>pkgname</key>
                <string>%NAME%-Firefox</string>
                <key>pkg_request</key>
                <dict>
                    <key>pkgdir</key>
                    <string>%RECIPE_CACHE_DIR%</string>
                    <key>id</key>
                    <string>com.facebook.pkg.lastpass.firefox</string>
                    <key>version</key>
                    <string>%version%</string>
                    <key>options</key>
                    <string>purge_ds_store</string>
                    <key>chown</key>
                    <array>
                        <dict>
                            <key>path</key>
                            <string>Applications</string>
                            <key>user</key>
                            <string>root</string>
                            <key>group</key>
                            <string>wheel</string>
                        </dict>
                    </array>
                </dict>
            </dict>
        </dict>
    </array>
</dict>
</plist>