<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Copyright</key>
		<string>Copyright (c) Facebook, Inc. and its affiliates. All Rights Reserved</string>
		<key>Description</key>
		<string>Downloads the latest version of DbVisualizer.</string>
		<key>Identifier</key>
		<string>com.facebook.autopkg.download.dbvisualizer</string>
		<key>Input</key>
		<dict>
			<key>NAME</key>
			<string>DbVisualizer</string>
			<key>VERSION</key>
			<string>11</string>
		</dict>
		<key>MinimumVersion</key>
		<string>0.5.0</string>
		<key>Process</key>
		<array>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>url</key>
					<string>https://www.dbvis.com/download</string>
					<key>re_pattern</key>
					<string>(https://dbvis.com/product_download/dbvis-[\S]+/media/dbvis_macos_[\S]+\.tgz)</string>
				</dict>
				<key>Processor</key>
				<string>URLTextSearcher</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>url</key>
					<string>https:%match%</string>
				</dict>
				<key>Processor</key>
				<string>URLDownloader</string>
			</dict>
			<dict>
				<key>Processor</key>
				<string>EndOfCheckPhase</string>
			</dict>
		</array>
	</dict>
</plist>
