<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Copyright</key>
		<string>Copyright (c) Facebook, Inc. and its affiliates. All Rights Reserved</string>
		<key>Description</key>
		<string>Downloads and makes a DMG of the latest version of DbVisualizer, and imports into Munki.</string>
		<key>Identifier</key>
		<string>com.facebook.autopkg.munki.dbvisualizer</string>
		<key>Input</key>
		<dict>
			<key>MUNKI_REPO_SUBDIR</key>
			<string>apps/DbVis</string>
			<key>NAME</key>
			<string>DbVisualizer</string>
			<key>VERSION</key>
			<string>11</string>
			<key>pkginfo</key>
			<dict>
				<key>catalogs</key>
				<array>
					<string>testing</string>
				</array>
				<key>category</key>
				<string>Database Tools</string>
				<key>description</key>
				<string>DbVisualizer is the universal database tool for developers,  DBAs and analysts. It is the perfect solution since the same tool can be used on all major operating systems accessing a wide range of databases.</string>
				<key>developer</key>
				<string>DbVis Software</string>
				<key>display_name</key>
				<string>DbVisualizer</string>
				<key>requires</key>
				<array>
					<string>OracleJava7</string>
				</array>
				<key>unattended_install</key>
				<true/>
			</dict>
		</dict>
		<key>MinimumVersion</key>
		<string>0.5.0</string>
		<key>ParentRecipe</key>
		<string>com.facebook.autopkg.dmg.dbvisualizer</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Processor</key>
                <string>DeprecationWarning</string>
                <key>Arguments</key>
                <dict>
                    <key>warning_message</key>
                    <string>These recipes have moved into nmcspadden-recipes, and the identifiers have changed. Please update your overrides!</string>
                </dict>
            </dict>
        </array>
	</dict>
</plist>
