<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Copyright</key>
    <string>Copyright (c) Facebook, Inc. and its affiliates. All Rights Reserved</string>
	<key>Description</key>
	<string>Imports the VMwareFusion mass deployment package into Munki. Requires justinrummel-recipes to download. You can substitute your own deploy.ini file in an override by placing the content in the DEPLOY_INI_FILE input variable. At a minimum, you'll need to put your license key in (replace the XXXXXs), or the postflight will fail.</string>
	<key>Identifier</key>
	<string>com.facebook.autopkg.munki.deploy.VMwareFusion</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>VMwareFusion</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/VMware</string>
		<key>DEPLOY_INI_FILE</key>
		<string>[Volume License]
key = XXXXX-XXXXX-XXXXX-XXXXX-XXXXX

[UI Defaults]

[Locations]

[Applications]

[Virtual Machines]
</string>
		<key>pkginfo</key>
		<dict>
			<key>blocking_applications</key>
			<array>
				<string>VMware Fusion.app</string>
			</array>
			<key>name</key>
			<string>%NAME%</string>
			<key>display_name</key>
			<string>VMWare Fusion Pro</string>
			<key>category</key>
			<string>Productivity</string>
			<key>developer</key>
			<string>VMware</string>
			<key>description</key>
			<string></string>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>uninstall_method</key>
			<string>uninstall_script</string>
			<key>uninstall_script</key>
			<string>#!/bin/sh
/bin/rm -rf /Applications/VMware\ Fusion.app
/bin/rm -f /Library/Preferences/VMware Fusion/config
</string>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.5</string>
	<key>ParentRecipe</key>
	<string>com.facebook.autopkg.pkg.deploy.VMwareFusion</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>DmgCreator</string>
			<key>Arguments</key>
			<dict>
				<key>dmg_root</key>
				<string>%pkgroot%</string>
				<key>dmg_path</key>
				<string>%RECIPE_CACHE_DIR%/DeployVMwareFusion.dmg</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>MunkiPkginfoMerger</string>
			<key>Arguments</key>
			<dict>
				<key>additional_pkginfo</key>
				<dict>
					<key>minimum_os_version</key>
					<string>%ls_minimum_system_version%</string>
					<key>version</key>
					<string>%version%</string>
				</dict>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%RECIPE_CACHE_DIR%/DeployVMwareFusion.dmg</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>
