<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Copyright</key>
		<string>Copyright (c) Facebook, Inc. and its affiliates. All Rights Reserved</string>
		<key>Description</key>
		<string>Imports the VMwareFusion mass deployment package into Munki. Requires justinrummel-recipes to download. You can substitute your own deploy.ini file in an override by placing the content in the DEPLOY_INI_FILE input variable. At a minimum, you'll need to put your license key in (replace the XXXXXs), or the postflight will fail.</string>
		<key>Identifier</key>
		<string>com.facebook.autopkg.munki.deploy.VMwareFusion</string>
		<key>Input</key>
		<dict>
			<key>MUNKI_REPO_SUBDIR</key>
			<string>apps/VMware</string>
			<key>NAME</key>
			<string>VMwareFusion</string>
			<key>pkginfo</key>
			<dict>
				<key>blocking_applications</key>
				<array>
					<string>VMware Fusion.app</string>
				</array>
				<key>catalogs</key>
				<array>
					<string>testing</string>
				</array>
				<key>category</key>
				<string>Productivity</string>
				<key>description</key>
				<string></string>
				<key>developer</key>
				<string>VMware</string>
				<key>display_name</key>
				<string>VMWare Fusion Pro</string>
				<key>minimum_os_version</key>
				<string>10.13</string>
				<key>name</key>
				<string>%NAME%</string>
				<key>uninstall_method</key>
				<string>uninstall_script</string>
				<key>uninstall_script</key>
				<string>#!/bin/sh
/bin/rm -rf /Applications/VMware\ Fusion.app
/bin/rm -f /Library/Preferences/VMware Fusion/config
				</string>
			</dict>
		</dict>
		<key>MinimumVersion</key>
		<string>0.2.5</string>
		<key>ParentRecipe</key>
		<string>com.facebook.autopkg.pkg.deploy.VMwareFusion</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Processor</key>
                <string>DeprecationWarning</string>
                <key>Arguments</key>
                <dict>
                    <key>warning_message</key>
                    <string>These recipes have moved into nmcspadden-recipes, and the identifiers have changed. Please update your overrides!</string>
                </dict>
            </dict>
        </array>
	</dict>
</plist>
