<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Copyright</key>
		<string>Copyright (c) Facebook, Inc. and its affiliates. All Rights Reserved</string>
		<key>Description</key>
		<string>Creates a VMwareFusion mass deployment package DMG. Requires justinrummel-recipes to download. You can substitute your own deploy.ini file in an override by placing the content in the DEPLOY_INI_FILE input variable. At a minimum, you'll need to put your license key in, or the postflight will fail.</string>
		<key>Identifier</key>
		<string>com.facebook.autopkg.pkg.deploy.VMwareFusion</string>
		<key>Input</key>
		<dict>
			<key>DEPLOY_INI_FILE</key>
			<string>[Volume License]
key = XXXXX-XXXXX-XXXXX-XXXXX-XXXXX

[UI Defaults]

[Locations]

[Applications]

[Virtual Machines]
			</string>
			<key>NAME</key>
			<string>VMwareFusionDeploy</string>
		</dict>
		<key>MinimumVersion</key>
		<string>0.2.5</string>
		<key>ParentRecipe</key>
		<string>com.justinrummel.download.VMwareFusion</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Processor</key>
                <string>DeprecationWarning</string>
                <key>Arguments</key>
                <dict>
                    <key>warning_message</key>
                    <string>These recipes have moved into nmcspadden-recipes, and the identifiers have changed. Please update your overrides!</string>
                </dict>
            </dict>
        </array>
	</dict>
</plist>
