<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Copyright</key>
        <string>Copyright (c) Facebook, Inc. and its affiliates. All Rights Reserved</string>
        <key>Description</key>
        <string>Takes the EXTRACTED DMG and imports into Munki.</string>
        <key>Identifier</key>
        <string>com.facebook.autopkg.munki.android_ndk</string>
        <key>Input</key>
        <dict>
            <key>DESTINATION_PATH</key>
            <string>/opt/android_ndk</string>
            <key>MUNKI_REPO_SUBDIR</key>
            <string>apps/%NAME%</string>
            <key>NAME</key>
            <string>android_ndk</string>
            <key>pkginfo</key>
            <dict>
                <key>catalogs</key>
                <array>
                    <string>testing</string>
                </array>
                <key>category</key>
                <string>Developer Tools</string>
                <key>description</key>
                <string>Android NDK. Be sure to set your ENV variable for ANDROID_NDK_REPOSITORY to /opt/android_ndk/.</string>
                <key>developer</key>
                <string>Google</string>
                <key>display_name</key>
                <string>Android NDK</string>
                <key>unattended_install</key>
                <true/>
            </dict>
        </dict>
        <key>MinimumVersion</key>
        <string>0.2.0</string>
        <key>ParentRecipe</key>
        <string>com.facebook.autopkg.dmg.android_ndk</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Processor</key>
                <string>DeprecationWarning</string>
                <key>Arguments</key>
                <dict>
                    <key>warning_message</key>
                    <string>These recipes have moved into nmcspadden-recipes, and the identifiers have changed. Please update your overrides!</string>
                </dict>
            </dict>
        </array>
    </dict>
</plist>
