<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest release of Android NDK.</string>
    <key>Identifier</key>
    <string>com.facebook.autopkg.download.android_ndk</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>android_ndk</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.5.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://developer.android.com/ndk/downloads/index.html</string>
                <key>re_pattern</key>
                <string>"(http:\/\/dl.google.com\/.*\/.*darwin-x86_64.bin)"</string>
            </dict>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%match%</string>
            </dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>AndroidNDKVersioner</string>
            <key>Arguments</key>
            <dict>
                <key>match</key>
                <string>%match%</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>