<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Copyright</key>
		<string>Copyright (c) Facebook, Inc. and its affiliates. All Rights Reserved</string>
		<key>Description</key>
		<string>Download, extract, and import Xcode as a unique entry into Munki. You must override the APPLE_ID and PASSWORD.</string>
		<key>Identifier</key>
		<string>com.facebook.autopkg.xcode_versioned.munki</string>
		<key>Input</key>
		<dict>
			<key>APPLE_ID</key>
			<string>dev@domain.com</string>
			<key>DESTINATION_APP_NAME</key>
			<string>Xcode.app</string>
			<key>ICON_NAME</key>
			<string>Xcode.png</string>
			<key>MUNKI_REPO_SUBDIR</key>
			<string>apps/apple/xcode/</string>
			<key>NAME</key>
			<string>Xcode</string>
			<key>PASSWORD_FILE</key>
			<string>secret.txt</string>
			<!-- Arbitrary_suffix optionally adds string between Xcode_X.Y.Z and .app -->
			<key>ARBITRARY_SUFFIX</key>
			<string></string>
			<key>pkginfo</key>
			<dict>
				<key>catalogs</key>
				<array>
					<string>testing</string>
				</array>
				<key>description</key>
				<string>Xcode</string>
				<key>display_name</key>
				<string>%NAME%</string>
				<key>name</key>
				<string>%NAME%</string>
				<key>unattended_install</key>
				<true/>
			</dict>
		</dict>
		<key>MinimumVersion</key>
		<string>1.0.4</string>
		<key>ParentRecipe</key>
		<string>com.facebook.autopkg.xcode.extract</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Processor</key>
                <string>DeprecationWarning</string>
                <key>Arguments</key>
                <dict>
                    <key>warning_message</key>
                    <string>These recipes have moved into nmcspadden-recipes, and the identifiers have changed. Please update your overrides!</string>
                </dict>
            </dict>
        </array>
	</dict>
</plist>
