<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<!-- Copyright (c) Facebook, Inc. and its affiliates. All Rights Reserved -->
<dict>
    <key>Description</key>
    <string>Extract Xcode from a XIP. Requires passing in a XIP containing Xcode.</string>
    <key>Identifier</key>
    <string>com.facebook.autopkg.xcode.extract</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Xcode</string>
        <key>BUILD_NUMBER_EMIT_PATH</key>
        <string>%RECIPE_CACHE_DIR%/xcode_build_number</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.4</string>
    <key>ParentRecipe</key>
    <string>com.facebook.autopkg.xcode.downloader</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Processor</key>
                <string>DeprecationWarning</string>
                <key>Arguments</key>
                <dict>
                    <key>warning_message</key>
                    <string>These recipes have moved into nmcspadden-recipes, and the identifiers have changed. Please update your overrides!</string>
                </dict>
            </dict>
        </array>

</dict>
</plist>
