<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<!-- Copyright (c) Facebook, Inc. and its affiliates. All Rights Reserved -->
<dict>
  <key>Description</key>
  <string>Extract Xcode from a XIP. Requires passing in a XIP containing Xcode.</string>
  <key>Identifier</key>
  <string>com.facebook.autopkg.xcode.extract</string>
  <key>Input</key>
  <dict>
    <key>NAME</key>
    <string>Xcode</string>
  </dict>
  <key>MinimumVersion</key>
  <string>1.0.5</string>
  <key>ParentRecipe</key>
  <string>com.facebook.autopkg.xcode.downloader</string>
  <key>Process</key>
  <array>
    <dict>
      <key>Processor</key>
      <string>XcodeXIPUnpacker</string>
      <key>Arguments</key>
      <dict>
        <key>PKG</key>
        <string>%pathname%</string>
      </dict>
    </dict>
    <dict>
      <key>Processor</key>
      <string>FileFinder</string>
      <key>Arguments</key>
      <dict>
        <key>pattern</key>
        <string>%RECIPE_CACHE_DIR%/%NAME%_unpack/*.app</string>
      </dict>
    </dict>
    <dict>
      <key>Processor</key>
      <string>CodeSignatureVerifier</string>
      <key>Arguments</key>
      <dict>
        <key>input_path</key>
        <string>%found_filename%</string>
        <key>requirement</key>
        <string>identifier "com.apple.dt.Xcode" and anchor apple</string>
      </dict>
    </dict>
    <dict>
      <key>Processor</key>
      <string>PlistReader</string>
      <key>Arguments</key>
      <dict>
        <key>info_path</key>
        <string>%found_filename%/Contents/version.plist</string>
        <key>plist_keys</key>
        <dict>
          <key>ProductBuildVersion</key>
          <string>productbuildversion</string>
          <key>CFBundleShortVersionString</key>
          <string>version</string>
          <key>CFBundleVersion</key>
          <string>bundleversion</string>
        </dict>
      </dict>
    </dict>
  </array>
</dict>
</plist>
