<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<!-- Copyright (c) Facebook, Inc. and its affiliates. All Rights Reserved -->
<dict>
  <key>Description</key>
  <string>Import Xcode as a unique entry into Munki. Requires passing in a XIP containing Xcode. Override ICON_NAME with the name of your Xcode icon.</string>
  <key>Identifier</key>
  <string>com.facebook.autopkg.xcode.munki</string>
  <key>Input</key>
  <dict>
    <key>NAME</key>
    <string>Xcode</string>
    <key>MUNKI_REPO_SUBDIR</key>
    <string>apps/apple/xcode/</string>
    <key>ICON_NAME</key>
    <string>Xcode.png</string>
    <key>DESTINATION_APP_NAME</key>
    <string>Xcode.app</string>
    <key>pkginfo</key>
    <dict>
      <key>catalogs</key>
      <array>
        <string>testing</string>
      </array>
      <key>description</key>
      <string>Xcode</string>
      <key>display_name</key>
      <string>%NAME%</string>
      <key>name</key>
      <string>%NAME%</string>
      <key>unattended_install</key>
      <true/>
    </dict>
  </dict>
  <key>MinimumVersion</key>
  <string>0.6.0</string>
  <key>ParentRecipe</key>
  <string>com.facebook.autopkg.xcode.extract</string>
  <key>Process</key>
  <array>
    <dict>
      <key>Processor</key>
      <string>XcodeVersioner</string>
      <key>Arguments</key>
      <dict>
        <key>version</key>
        <string>%version%</string>
      </dict>
    </dict>
    <dict>
      <key>Processor</key>
      <string>PkgRootCreator</string>
      <key>Arguments</key>
      <dict>
        <key>pkgroot</key>
        <string>%RECIPE_CACHE_DIR%/%NAME%</string>
        <key>pkgdirs</key>
        <dict>
          <key>Applications</key>
          <string>0755</string>
        </dict>
      </dict>
    </dict>
    <dict>
      <key>Processor</key>
      <string>FileMover</string>
      <key>Arguments</key>
      <dict>
        <key>source</key>
        <string>%output_app%</string>
        <key>target</key>
        <string>%pkgroot%/Applications/%NAME%_%major_version%.%minor_version%.app</string>
      </dict>
    </dict>
    <dict>
      <key>Processor</key>
      <string>MunkiInstallsItemsCreator</string>
      <key>Arguments</key>
      <dict>
        <key>faux_root</key>
        <string>%pkgroot%</string>
        <key>installs_item_paths</key>
        <array>
          <key>/Applications/%NAME%_%major_version%.%minor_version%.app</key>
        </array>
        <key>version_comparison_key</key>
        <string>CFBundleVersion</string>
      </dict>
    </dict>
    <dict>
      <key>Processor</key>
      <string>MunkiPkginfoMerger</string>
    </dict>
    <dict>
      <key>Processor</key>
      <string>com.facebook.autopkg.shared/InstallsArrayFineTuning</string>
      <key>Arguments</key>
      <dict>
        <key>changes</key>
        <array>
          <dict>
            <key>path</key>
            <string>/Applications/%NAME%_%major_version%.%minor_version%.app</string>
            <key>type</key>
            <string>bundle</string>
          </dict>
        </array>
      </dict>
    </dict>
    <dict>
      <key>Processor</key>
      <string>MunkiPkginfoMerger</string>
      <key>Arguments</key>
      <dict>
        <key>additional_pkginfo</key>
        <dict>
          <key>display_name</key>
          <string>%NAME% %version% (%productbuildversion%)</string>
          <key>icon_name</key>
          <string>%ICON_NAME%</string>
          <key>name</key>
          <string>%NAME%%major_version%.%minor_version%</string>
          <key>version</key>
          <string>%major_version%.%minor_version%.%patch_version%.%bundleversion%</string>
        </dict>
      </dict>
    </dict>
    <dict>
      <key>Processor</key>
      <string>DmgCreator</string>
      <key>Arguments</key>
      <dict>
        <key>dmg_root</key>
        <string>%pkgroot%/Applications</string>
        <key>dmg_path</key>
        <string>%RECIPE_CACHE_DIR%/%NAME%_%version%.dmg</string>
      </dict>
    </dict>
    <dict>
      <key>Arguments</key>
      <dict>
        <key>pkg_path</key>
        <string>%RECIPE_CACHE_DIR%/%NAME%_%version%.dmg</string>
        <key>repo_subdirectory</key>
        <string>%MUNKI_REPO_SUBDIR%</string>
        <key>additional_makepkginfo_options</key>
        <array>
          <string>--destinationitemname=%DESTINATION_APP_NAME%</string>
          <string>--owner=root</string>
          <string>--group=wheel</string>
          <string>--mode=u+rwx,go+rx</string>
        </array>
      </dict>
      <key>Processor</key>
      <string>MunkiImporter</string>
    </dict>
    <dict>
      <key>Processor</key>
      <string>PathDeleter</string>
      <key>Arguments</key>
      <dict>
        <key>path_list</key>
        <array>
          <string>%pkgroot%</string>
          <string>%RECIPE_CACHE_DIR%/%NAME%_unpack</string>
        </array>
      </dict>
    </dict>
  </array>
</dict>
</plist>
