<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Copyright</key>
		<string>Copyright (c) Facebook, Inc. and its affiliates. All Rights Reserved</string>
		<key>Description</key>
		<string>Download, extract, and import Xcode as a unique entry into Munki. You must override the APPLE_ID and PASSWORD.</string>
		<key>Identifier</key>
		<string>com.facebook.autopkg.xcode_versioned.munki</string>
		<key>Input</key>
		<dict>
			<key>APPLE_ID</key>
			<string>dev@domain.com</string>
			<key>DESTINATION_APP_NAME</key>
			<string>Xcode.app</string>
			<key>ICON_NAME</key>
			<string>Xcode.png</string>
			<key>MUNKI_REPO_SUBDIR</key>
			<string>apps/apple/xcode/</string>
			<key>NAME</key>
			<string>Xcode</string>
			<key>PASSWORD_FILE</key>
			<string>secret.txt</string>
			<!-- Arbitrary_suffix optionally adds string between Xcode_X.Y.Z and .app -->
			<key>ARBITRARY_SUFFIX</key>
			<string></string>
			<key>pkginfo</key>
			<dict>
				<key>catalogs</key>
				<array>
					<string>testing</string>
				</array>
				<key>description</key>
				<string>Xcode</string>
				<key>display_name</key>
				<string>%NAME%</string>
				<key>name</key>
				<string>%NAME%</string>
				<key>unattended_install</key>
				<true/>
			</dict>
		</dict>
		<key>MinimumVersion</key>
		<string>1.0.4</string>
		<key>ParentRecipe</key>
		<string>com.facebook.autopkg.xcode.extract</string>
		<key>Process</key>
		<array>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>version</key>
					<string>%version%</string>
				</dict>
				<key>Processor</key>
				<string>XcodeVersioner</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>source</key>
					<string>%found_filename%</string>
					<key>target</key>
					<string>%RECIPE_CACHE_DIR%/%NAME%_%major_version%.%minor_version%.%patch_version%%ARBITRARY_SUFFIX%.app</string>
				</dict>
				<key>Processor</key>
				<string>FileMover</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>dmg_path</key>
					<string>%RECIPE_CACHE_DIR%/%NAME%_%major_version%.%minor_version%.%patch_version%.dmg</string>
					<key>dmg_root</key>
					<string>%RECIPE_CACHE_DIR%/%NAME%_%major_version%.%minor_version%.%patch_version%%ARBITRARY_SUFFIX%.app</string>
				</dict>
				<key>Processor</key>
				<string>DmgCreator</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>additional_pkginfo</key>
					<dict>
						<key>display_name</key>
						<string>%NAME% %major_version%.%minor_version%.%patch_version%</string>
						<key>icon_name</key>
						<string>%ICON_NAME%</string>
						<key>name</key>
						<string>%NAME%%major_version%</string>
						<key>version</key>
						<string>%major_version%.%minor_version%.%patch_version%</string>
					</dict>
				</dict>
				<key>Processor</key>
				<string>MunkiPkginfoMerger</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>pkg_path</key>
					<string>%RECIPE_CACHE_DIR%/%NAME%_%major_version%.%minor_version%.%patch_version%.dmg</string>
					<key>repo_subdirectory</key>
					<string>%MUNKI_REPO_SUBDIR%</string>
				</dict>
				<key>Processor</key>
				<string>MunkiImporter</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>path_list</key>
					<array>
						<string>%RECIPE_CACHE_DIR%/%NAME%_unpack</string>
						<string>%RECIPE_CACHE_DIR%/%NAME%_%major_version%.%minor_version%.%patch_version%%ARBITRARY_SUFFIX%.app</string>
					</array>
				</dict>
				<key>Processor</key>
				<string>PathDeleter</string>
			</dict>
		</array>
	</dict>
</plist>
