<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Copyright</key>
	<string>Copyright (c) Facebook, Inc. and its affiliates. All Rights Reserved</string>
	<key>Description</key>
	<string>Download Xcode from the Apple dev portal. You must override the APPLE_ID and PASSWORD.</string>
	<key>Identifier</key>
	<string>com.facebook.autopkg.xcode.downloader</string>
	<key>Input</key>
	<dict>
		<key>APPLE_ID</key>
		<string>dev@domain.com</string>
		<key>NAME</key>
		<string>Xcode</string>
		<key>PASSWORD</key>
		<string>password</string>
		<key>PATTERN</key>
		<string>(.*Developer_Tools\/Xcode_.*\/Xcode_[^\/]*xip)</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.4</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>appID_key</key>
				<string>891bd3417a7776362562d2197f89480a8547b108fd934911bcbea0110d07f757</string>
				<key>apple_id</key>
				<string>%APPLE_ID%</string>
				<key>password</key>
				<string>%PASSWORD%</string>
			</dict>
			<key>Processor</key>
			<string>AppleDataGatherer</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>login_data</key>
				<string>%RECIPE_CACHE_DIR%/downloads/login_data</string>
			</dict>
			<key>Processor</key>
			<string>AppleCookieDownloader</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
				<string>%PATTERN%</string>
			</dict>
			<key>Processor</key>
			<string>AppleURLSearcher</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>curl_opts</key>
				<array>
					<string>--request</string>
					<string>GET</string>
					<string>--cookie</string>
					<string>%download_cookies%</string>
				</array>
				<key>url</key>
				<string>%match%</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>path_list</key>
				<array>
					<string>%RECIPE_CACHE_DIR%/downloads/login_data</string>
				</array>
			</dict>
			<key>Processor</key>
			<string>PathDeleter</string>
		</dict>
	</array>
</dict>
</plist>
