<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Copyright</key>
		<string>Copyright (c) Facebook, Inc. and its affiliates. All Rights Reserved</string>
		<key>Description</key>
		<string>Pacakges the lobbyvideo file</string>
		<key>Identifier</key>
		<string>com.facebook.autopkg.dmg.lobbyvideo</string>
		<key>Input</key>
		<dict>
			<key>DESTINATION_PATH</key>
			<string>/Users/Shared</string>
			<key>NAME</key>
			<string>lobbyvideo</string>
			<key>RULESET_NAME</key>
			<string>lobbyvideo.mp4</string>
			<key>SOURCE_DIR</key>
			<string>/Users/Shared/lobby_video</string>
		</dict>
		<key>MinimumVersion</key>
		<string>0.2.0</string>
		<key>Process</key>
		<array>
            <dict>
                <key>Processor</key>
                <string>DeprecationWarning</string>
                <key>Arguments</key>
                <dict>
                    <key>warning_message</key>
                    <string>This recipe will soon be removed. Please remove it from your list of recipes.</string>
                </dict>
            </dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>pkgdirs</key>
					<dict>
						<key>dmg_root</key>
						<string>0775</string>
					</dict>
					<key>pkgroot</key>
					<string>%RECIPE_CACHE_DIR%/</string>
				</dict>
				<key>Processor</key>
				<string>PkgRootCreator</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>destination_path</key>
					<string>%RECIPE_CACHE_DIR%/dmg_root/</string>
					<key>source_path</key>
					<string>%SOURCE_DIR%/%RULESET_NAME%</string>
				</dict>
				<key>Processor</key>
				<string>Copier</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>notime</key>
					<false/>
				</dict>
				<key>Processor</key>
				<string>DateVersioner</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>dmg_path</key>
					<string>%RECIPE_CACHE_DIR%/%NAME%-%version%.dmg</string>
					<key>dmg_root</key>
					<string>%RECIPE_CACHE_DIR%/dmg_root/</string>
				</dict>
				<key>Processor</key>
				<string>DmgCreator</string>
			</dict>
		</array>
	</dict>
</plist>
